IlleniumDillon/MM32LLD/MM32/Sfr/MM32_SPIReg.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2022-10-31 10:33:40
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2022-10-31 20:07:46
 * @FilePath: \CODE\MM32\Sfr\MM32_SPIReg.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#ifndef _MM32_SPIREG_H_
#define _MM32_SPIREG_H_

#include "MM32_RegBase.h"

#include "MM32_SPIRegDef.h"

#define MOUDLE_SPI2		((MM32_SPI*)SPI2_BASE)

#define MOUDLE_SPI3		((MM32_SPI*)SPI3_BASE)

#define MOUDLE_SPI1		((MM32_SPI*)SPI1_BASE)

#define SPI2_TXREG		((MM32_SPI_TXREG*)(SPI2_BASE+0X00))

#define SPI2_RXREG		((MM32_SPI_RXREG*)(SPI2_BASE+0X04))

#define SPI2_CSTAT		((MM32_SPI_CSTAT*)(SPI2_BASE+0X08))

#define SPI2_INTSTAT		((MM32_SPI_INTSTAT*)(SPI2_BASE+0X0C))

#define SPI2_INTEN		((MM32_SPI_INTEN*)(SPI2_BASE+0X10))

#define SPI2_INTCLR		((MM32_SPI_INTCLR*)(SPI2_BASE+0X14))

#define SPI2_GCTL		((MM32_SPI_GCTL*)(SPI2_BASE+0X18))

#define SPI2_CCTL		((MM32_SPI_CCTL*)(SPI2_BASE+0X1C))

#define SPI2_SPBRG		((MM32_SPI_SPBRG*)(SPI2_BASE+0X20))

#define SPI2_RXDNR		((MM32_SPI_RXDNR*)(SPI2_BASE+0X24))

#define SPI2_NSSR		((MM32_SPI_NSSR*)(SPI2_BASE+0X28))

#define SPI2_EXTCTL		((MM32_SPI_EXTCTL*)(SPI2_BASE+0X2C))

#define SPI2_I2SCFGR		((MM32_SPI_I2SCFGR*)(SPI2_BASE+0X30))

#define SPI3_TXREG		((MM32_SPI_TXREG*)(SPI3_BASE+0X00))

#define SPI3_RXREG		((MM32_SPI_RXREG*)(SPI3_BASE+0X04))

#define SPI3_CSTAT		((MM32_SPI_CSTAT*)(SPI3_BASE+0X08))

#define SPI3_INTSTAT		((MM32_SPI_INTSTAT*)(SPI3_BASE+0X0C))

#define SPI3_INTEN		((MM32_SPI_INTEN*)(SPI3_BASE+0X10))

#define SPI3_INTCLR		((MM32_SPI_INTCLR*)(SPI3_BASE+0X14))

#define SPI3_GCTL		((MM32_SPI_GCTL*)(SPI3_BASE+0X18))

#define SPI3_CCTL		((MM32_SPI_CCTL*)(SPI3_BASE+0X1C))

#define SPI3_SPBRG		((MM32_SPI_SPBRG*)(SPI3_BASE+0X20))

#define SPI3_RXDNR		((MM32_SPI_RXDNR*)(SPI3_BASE+0X24))

#define SPI3_NSSR		((MM32_SPI_NSSR*)(SPI3_BASE+0X28))

#define SPI3_EXTCTL		((MM32_SPI_EXTCTL*)(SPI3_BASE+0X2C))

#define SPI3_I2SCFGR		((MM32_SPI_I2SCFGR*)(SPI3_BASE+0X30))

#define SPI1_TXREG		((MM32_SPI_TXREG*)(SPI1_BASE+0X00))

#define SPI1_RXREG		((MM32_SPI_RXREG*)(SPI1_BASE+0X04))

#define SPI1_CSTAT		((MM32_SPI_CSTAT*)(SPI1_BASE+0X08))

#define SPI1_INTSTAT		((MM32_SPI_INTSTAT*)(SPI1_BASE+0X0C))

#define SPI1_INTEN		((MM32_SPI_INTEN*)(SPI1_BASE+0X10))

#define SPI1_INTCLR		((MM32_SPI_INTCLR*)(SPI1_BASE+0X14))

#define SPI1_GCTL		((MM32_SPI_GCTL*)(SPI1_BASE+0X18))

#define SPI1_CCTL		((MM32_SPI_CCTL*)(SPI1_BASE+0X1C))

#define SPI1_SPBRG		((MM32_SPI_SPBRG*)(SPI1_BASE+0X20))

#define SPI1_RXDNR		((MM32_SPI_RXDNR*)(SPI1_BASE+0X24))

#define SPI1_NSSR		((MM32_SPI_NSSR*)(SPI1_BASE+0X28))

#define SPI1_EXTCTL		((MM32_SPI_EXTCTL*)(SPI1_BASE+0X2C))

#define SPI1_I2SCFGR		((MM32_SPI_I2SCFGR*)(SPI1_BASE+0X30))

#endif